basic/basic/controllers/home/ConsignmentController.php

    public function actionIndex()
    {

       //查询寄卖品
        $consignment_model = new Consignment();
        if(empty($_GET['search'])){
            $data['data'] = $consignment_model->selectAll(10,'','');
            $data['type'] = 0;
        } elseif($_GET['search'] == 'new'){
            $data['data'] = $consignment_model->selectAll(10,array('add_time'=>SORT_DESC),'');
            $data['type'] = 1;
        } elseif($_GET['search'] == 'credit'){
            $data['data'] = $consignment_model->selectAll(10,array('credit'=>SORT_DESC),'');
            $data['type'] = 2;
        } elseif($_GET['search'] == 'price'){
            $data['data'] = $consignment_model->selectAll(10,array('shop_price'=>SORT_DESC),'');
            $data['type'] = 3;
        }
        $data['page'] = $this->page(Consignment::find()->count(),10);
---
SELECT COUNT(*) FROM `mb_consignment`