basic/basic/controllers/home/WatchController.php

    public function actionBoylist()
    {
        $goods = new Goods();   //商品
        $order = 'ASC';
        $data['goodsList'] = $goods->showType('2',$order);
        $data['brandList'] = $this->BrandAll(); //查询品牌

        $count = Goods::find()->count();    //数据总条数
---
SELECT COUNT(*) FROM `mb_goods`

            $limit = ($p-1)*$this->onePage; //偏移量
        }

        $count = Goods::find()->where(['is_show'=>'1'])->andWhere(['gt_id'=>'2'])->count();    //数据总条数
---
SELECT COUNT(*) FROM `mb_goods` WHERE (`is_show`='1') AND (`gt_id`='2')