basic/basic/models/Admin.php

SELECT * FROM `mb_admin`
---
    public function show($id = null)
    {
        if (isset($id)) {
            return $this->find()->where(['admin_id' => $id])->asArray()->one();
        } else {
            return $this->find()->asArray()->all();