basic/basic/models/Brand.php

SELECT `brand_id` FROM `mb_brand` WHERE `brand_name` LIKE '%天%'
SELECT `g_id`, `gt_id`, `goods_name`, `brand_id`, `shop_price`, `keywords`, `g_img` FROM `mb_goods` WHERE ((`brand_id`='4') AND (`gt_id`='2')) AND (`is_show`='1')
---
    public function brandGoods($brand_name,$gt_id)
    {
        //品牌ID
        $brand_id = Brand::find()->select('brand_id')->where(['like','brand_name',$brand_name])->asArray()->one()['brand_id'];
        return Goods::find()
            ->select(array('g_id','gt_id','goods_name','brand_id','shop_price','keywords','g_img'))
            ->where(['brand_id'=>$brand_id])
            ->andWhere(['gt_id'=>$gt_id])
            ->andWhere(['is_show'=>'1'])
            ->asArray()
            ->all();