basic/basic/models/Category.php

SELECT * FROM `mb_category` WHERE `rank`=1
---
    public function rank_select()
    {
        $arr = $this->find()->where(['rank'=>1])->asArray()->all();