basic/basic/models/Category.php

    public function rank_select()
    {
        $arr = $this->find()->asArray()->all();
---
SELECT * FROM `mb_category`