basic/basic/models/Collect.php

    public function show($user_id = null)
    {
        return $this->find()->where(['user_id'=>$user_id])->asArray()->All();
---
SELECT * FROM `mb_collect` WHERE `user_id`=2