basic/basic/models/Consignment.php

    public function selectAll2($p)
    {
        $session = \Yii::$app->session;
        $arr = (new \yii\db\Query())->from('mb_consignment')
            ->select(array('consignment_id','author','shop_price','g_brand','is_bargain','describe','g_img','add_time','mb_user.user_id','shop_status','credit','is_bargain'))
            ->innerJoin('mb_user',"mb_consignment.user_id=mb_user.user_id")->where(['mb_consignment.user_id'=>$session->get('user_id')]);
        $pages = new Pagination(['totalCount' =>$arr->count(), 'pageSize' =>$p]);
        $data['data'] = $arr->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT author,shop_price,g_img,add_time,credit FROM `mb_consignment` inner join mb_user on mb_consignment.user_id=mb_user.user_id where mb_consignment.user_id=1
SELECT COUNT(*) FROM `mb_consignment` INNER JOIN `mb_user` ON mb_consignment.user_id=mb_user.user_id WHERE `mb_consignment`.`user_id`=1
SELECT `consignment_id`, `author`, `shop_price`, `g_brand`, `describe`, `g_img`, `add_time`, `mb_user`.`user_id`, `shop_status`, `credit`, `is_bargain` FROM `mb_consignment` INNER JOIN `mb_user` ON mb_consignment.user_id=mb_user.user_id WHERE `mb_consignment`.`user_id`=1 LIMIT 3
SELECT `consignment_id`, `author`, `shop_price`, `g_brand`, `describe`, `g_img`, `add_time`, `mb_user`.`user_id`, `shop_status`, `credit` FROM `mb_consignment` INNER JOIN `mb_user` ON mb_consignment.user_id=mb_user.user_id ORDER BY `add_time` DESC LIMIT 10