basic/basic/models/Goods.php

SELECT `g_id`, `gt_id`, `goods_name`, `brand_id`, `shop_price`, `keywords`, `g_img` FROM `mb_goods` WHERE (`gt_id`='2') AND (`is_show`=1) ORDER BY `shop_price` LIMIT 8
---
    public function showType($type,$order)
    {
        return Goods::find()
            ->select(array('g_id','gt_id','goods_name','brand_id','shop_price','keywords','g_img'))
            ->where(['gt_id'=>$type])
            ->andWhere(['is_show'=>1])
            ->orderBy('shop_price '.$order)
            ->limit(8,0)
            ->orderBy('shop_price')
            ->asArray()
            ->all();

SELECT `g_id`, `gt_id`, `goods_name`, `brand_id`, `shop_price`, `keywords`, `g_img` FROM `mb_goods` WHERE (((`brand_id`='8') AND (`is_show`='1')) AND (`gt_id`='2')) AND (`brand_id`='8') ORDER BY `shop_price` DESC LIMIT 8
SELECT `g_id`, `gt_id`, `goods_name`, `brand_id`, `shop_price`, `keywords`, `g_img` FROM `mb_goods` WHERE (`gt_id`='2') AND (`is_show`='1') ORDER BY `shop_price` DESC LIMIT 8
SELECT `g_id`, `gt_id`, `goods_name`, `brand_id`, `shop_price`, `keywords`, `g_img` FROM `mb_goods` WHERE (`gt_id`='2') AND (`is_show`='1') ORDER BY `shop_price` DESC LIMIT 8 OFFSET 24
---
    public function showBrand($order,$orderField,$field,$val,$limit,$gt_id,$onePage)
    {
        if (is_numeric($val)) {
            return Goods::find()
                ->select(array('g_id', 'gt_id', 'goods_name', 'brand_id', 'shop_price', 'keywords', 'g_img'))
                ->where([$field => $val])
                ->andWhere(['is_show' => '1'])
                ->andWhere(['gt_id' => $gt_id])
                ->andWhere([$field => $val])
                ->orderBy($orderField . ' ' . $order)
                ->offset($limit)
                ->limit($onePage)
                ->asArray()
                ->all();
        } else if(empty($gt_id)){
            return Goods::find()
                ->select(array('g_id', 'gt_id', 'goods_name', 'brand_id', 'shop_price', 'keywords', 'g_img'))
                ->andWhere(['is_show' => '1'])
                ->orderBy($orderField . ' ' . $order)
                ->offset($limit)
                ->limit($onePage)
                ->asArray()
                ->all();
        } else{
            return Goods::find()
                ->select(array('g_id', 'gt_id', 'goods_name', 'brand_id', 'shop_price', 'keywords', 'g_img'))
                ->andWhere(['is_show' => '1'])
                ->andWhere(['gt_id'=>$gt_id])
                ->orderBy($orderField . ' ' . $order)
                ->offset($limit)
                ->limit($onePage)
                ->asArray()
                ->all();