basic/basic/models/Goods.php

    public function showBrand($field,$val,$gt_id)
    {
        return Goods::find()
            ->select(array('g_id','gt_id','goods_name','brand_id','shop_price','keywords','g_img'))
            ->where([$field=>$val])
            ->andWhere(['gt_id'=>$gt_id])
            ->asArray()->all();
---
SELECT `g_id`, `gt_id`, `goods_name`, `brand_id`, `shop_price`, `keywords`, `g_img` FROM `mb_goods` WHERE (`brand_id`='7') AND (`gt_id`='2')