basic/basic/models/History.php

    public function history_all($user_id)
    {
        $data = History::find()->where(['user_id'=>$user_id])->asArray()->All();
---
SELECT * FROM `mb_history` WHERE `user_id`=2