basic/basic/models/Integral_rule.php

SELECT * FROM `mb_integral_rule`
---
    public function rule_show($user_id = null)
    {
        return $this->find()->asArray()->All();