basic/basic/models/Nav.php

SELECT * FROM `mb_nav`
---
    public function recursion()
    {
        $arr =array();
        $arr1 = array();
        $info =  Nav::find()->asArray()->all();