basic/basic/models/Nav.php

SELECT * FROM `mb_nav` WHERE `nav_place`=1
SELECT * FROM `mb_nav` WHERE `nav_place`=2
SELECT * FROM `mb_nav` WHERE `nav_pid`='0-10'
---
    public function recursion($nav_pid=0)
    {
        $info['zhu'] =  Nav::find()->where(['nav_place' =>1])->asArray()->all();
        $info['top'] =  Nav::find()->where(['nav_place' =>2])->asArray()->all();
        $arr =  $this->nav_List('where nav_place = 3 and nav_type = 1');
        foreach($arr as $key=>$val){
            $arr[$key]['child'] = Nav::find()->where(['nav_pid' =>$val['nav_pid'].'-'.$val['nav_id']])->asArray()->all();