basic/basic/models/Role_admin.php

    public function roleAll($admin_id)
    {
        $roleAll = $this->find()->where(['admin_id'=>$admin_id])->asArray()->all();
        $role_id = array_column($roleAll,'role_id');    //获取用户拥有的角色ID
        $node_id = Role_node::find()->where(['IN','role_id',$role_id])->asArray()->all();
        $node_id = array_column($node_id,'node_id');    //获取用户拥有的权限ID
        $nodeAll = Node::find()->where(['IN','node_id',$node_id])->asArray()->all();
---
SELECT * FROM `mb_role_admin` WHERE `admin_id`='17'
SELECT * FROM `mb_role_node` WHERE `role_id` IN ('7', '6')
SELECT * FROM `mb_node` WHERE `node_id` IN ('23', '26', '24', '27', '24', '26', '28', '29', '30', '31', '32', '33', '34', '35', '36', '50', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49', '53', '54')